{
  "broadArea": {
    "name": "Biotechnology and Biomedical Engineering",
    "link": "http://www.vlab.co.in/broad-area-biotechnology-and-biomedical-engineering",
    "code": "BIO"
  },
  "lab": "Introduction to Bioinformatics Algorithms",
  "lab_display_name": "Introduction to Bioinformatics Algorithms",
  "phase": "3-ext",
  "collegeName": "AMRT",
  "baseUrl": "iba-amrt.vlabs.ac.in",
  "introduction": "The Introduction to Bioinformatics Algorithms virtual lab is an interactive online platform designed to provide students with a solid foundation in the computational techniques used in modern bioinformatics. This lab offers a unique blend of theoretical understanding and hands-on experience with biological data, enabling learners to explore how algorithms are applied to solve real-world problems in biology and biotechnology.<br>Through a series of carefully structured experiments, students will engage with fundamental bioinformatics algorithms such as phylogenetic tree construction (Fitch-Margoliash, Neighbor-Joining), RNA secondary structure prediction (Nussinov and Zuker algorithms), sequence assembly (De Bruijn graphs), gene prediction (Viterbi algorithm), and peptide sequencing (Branch-and-Bound). These modules are designed to build both conceptual clarity and practical skills.<br>This virtual lab serves as an ideal learning tool for undergraduate and postgraduate students from disciplines like biotechnology, bioinformatics, microbiology, and computational biology. It supports tutor-independent learning and introduces basic programming skills relevant to analyzing and interpreting biological data.<br>By the end of the course, students will be equipped to apply bioinformatics algorithms confidently and will be better prepared for experimental research or advanced study in interdisciplinary fields that combine biology, computer science, and data analysis",
  "experiments":[
  {
    "name": "Phylogenetic Tree Reconstruction Using the Fitch-Margoliash (FM) Algorithm",
    "short-name": "fm-tree",
    "repo": "https://github.com/virtual-labs/exp-fm-tree-au",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Implementation of the Neighbor-Joining (NJ) Algorithm for Phylogenetic Tree Construction",
    "short-name": "nj-tree",
    "repo": "https://github.com/virtual-labs/exp-nj-tree-au",
    "tag": "v1.0.1",
    "deploy": true
  },
  {
    "name": "Exploring RNA Secondary Structure Prediction using the Nussinov Algorithm",
    "short-name": "rna-nussinov",
    "repo": "https://github.com/virtual-labs/exp-rna-nussinov-au",
    "tag": "v1.0.1",
    "deploy": true
  },
  {
    "name": "Determining groups for Gene Expression Analysis using Genetic algorithm (GA)",
    "short-name": "ga-groups",
    "repo": "https://github.com/virtual-labs/exp-ga-groups-au",
    "tag": "v1.0.1",
    "deploy": true
  },
  {
    "name": "Construction of De Bruijn Graphs for Sequence Assembly",
    "short-name": "debruijn-graph",
    "repo": "https://github.com/virtual-labs/exp-debruijn-graph-au",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Exploring the Viterbi Algorithm for exon-intron prediction",
    "short-name": "viterbi-exons",
    "repo": "https://github.com/virtual-labs/exp-viterbi-exons-au",
    "tag": "v1.0.1",
    "deploy": true
  },
  {
    "name": "Analyze network topology by implementing Dijkstra’s Algorithm",
    "short-name": "dijkstra-net",
    "repo": "https://github.com/virtual-labs/exp-dijkstra-net-au",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Efficient RNA Secondary Structure Prediction Using the Zuker Algorithm",
    "short-name": "zuker-rna",
    "repo": "https://github.com/virtual-labs/exp-zuker-rna-au",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Branch-and-Bound Algorithm for Cyclopeptide Sequencing",
    "short-name": "bnb-cyclo",
    "repo": "https://github.com/virtual-labs/exp-bnb-cyclo-au",
    "tag": "v1.0.0",
    "deploy": true
  }
],
  "targetAudience": {
    "UG": [
    "Biotechnology",
    "Bioinformatics",
    "Microbiology",
    "Computational Biology",
    "Computer Science (with interest in life sciences)"
    ],
    "PG": [
    "Bioinformatics",
    "Systems Biology",
    "Molecular Biology",
    "Biotechnology"
    ]
  },
  "objective": "The primary objective of the Introduction to Bioinformatics Algorithms virtual lab is to enable students to understand, implement, and apply fundamental algorithms used in the field of bioinformatics. This lab aims to:<ul><li>Provide a conceptual and practical understanding of key bioinformatics algorithms.<li>Bridge the gap between theoretical learning and real-world application in biological data analysis.</li><li>Offer hands-on experience with computational tools and methods used in bioinformatics and computational biology.</li><li>Support interdisciplinary learning for students from biology, biotechnology, computer science, and related domains.</li><li>Develop problem-solving and algorithmic thinking skills through interactive, simulation-based experiments.</li><li>Encourage self-paced, tutor-independent learning using real biological datasets.</li><li>This lab empowers learners to approach biological problems with computational methods, preparing them for advanced research and interdisciplinary applications in the life sciences.</li></ul>",
  "courseAlignment": {
    "description": "The Introduction to Bioinformatics Algorithms virtual lab is designed to complement and enhance the learning outcomes of various undergraduate and postgraduate courses in bioinformatics and computational biology. The experiments and learning activities are aligned with core topics covered in the following courses:",
    "universities": [
    "Bioinformatics and Computational Biology – PC212",
    "Bioinformatics – BT8651",
    "Bioinformatics – BIT 2004",
    "Bioinformatics – BV1551",
    "Introduction to Bioinformatics – 5EC",
    "Bioinformatics – 10BT-56",
    "Anna University – B.Tech in Biotechnology (Bioinformatics)",
    "Visvesvaraya Technological University, Karnataka – B.Tech in Biotechnology (Bioinformatics)",
    "Bharathiar University, Tamil Nadu – B.Sc in Biotechnology (Introduction to Bioinformatics)",
    "University of Kerala – B.Sc in Zoology/Botany/Biotechnology/Microbiology (Bioinformatics)",
    "Manipal University – B.Tech in Biotechnology (BIO 3161: Bioinformatics Lab)"
    ]

  }
}
